# Попросите пользователя ввести текст
# Выведите:
# 1. Текст в верхнем регистре (все ЗАГЛАВНЫЕ)
# 2. Текст в нижнем регистре (все маленькие)
# 3. Текст с первой заглавной буквой (capitalize)
# 4. Текст где первая буква каждого слова заглавная (title)


"""
a = input('my name is sasha')
print(a.upper())

print(a.lower())

print(a.capitalize())

print(a.title())
"""

# Попросите пользователя ввести строку
# Проверьте и выведите:
# - Только ли буквы в строке? (isalpha)
# - Только ли цифры в строке? (isdigit)
# - Длина строки (len)


a = input("привет мир ")

#print(a.isalpha())

print(a.isdigit())

print(len(a))



# Попросите пользователя ввести предложение
# Попросите ввести слово для замены
# Попросите ввести новое слово
# Выведите предложение с заменой (используйте replace)
# Выведите количество замен (используйте count)



a = input("приежали саберать гребы")





